[
  {
    "groupName": "Earth + Sky Zen, Dublin Dojo",
    "eventTime": "2024-04-14T18:15:00+01:00",
    "eventDetails": "The meaning of the word zen is meditation, zazen means sitting meditation. In zazen practice we begin to know ourselves, and to go beyond the limits of our personal ego. Within our tradition zazen is referred to as shikantaza, not doing, letting go of thoughts, dropping off body and mind. This sitting meditation is the focus of our practice. Language limits our ability to communicate the true nature of zen; it is something that is better understood through practice. We are open to everyone interested in learning about zen. Intro workshop for newcomers is available at 5.30pm each Sunday. The dojo is a sacred place and it is important to be considerate of everyone. We have many people that travel to practise together once a week or once a month. So for that reason it is really essential that we all know the structure of the sitting practise (when to sit, how to do Kinhin, the different bell sounds and their meaning etc), to ensure a silent, safe and meaningful meditation. And it's also great to meet everyone before the sitting practise. And answer any questions you may have. We have zafus and zabutons (mats and cushions) for all to sit on. Chairs are available too. Comfortable clothing for sitting, black or neutral tones best. We greatly appreciate a donation of €5 to cover costs if it's possible for you. Please arrive 10min before start so 6ish (if you're not doing the intro workshop). You are very welcome to our dojo!",
    "lat": 53.356857,
    "lon": -6.259533,
    "locationInfo": "1 Gardiner Street Upper, Dublin 1, D",
    "eventName": "Zazen Meditation + Dharma talk or Kinhin",
    "eventEndTime": "2024-04-14T19:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/d/4/9/600_505012553.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/earth-sky-zen-dublin-dojo/events/300012999/?recId=38617082-9729-47d2-9be4-f93f704ae2a7&recSource=ml-popular-events-nearby&searchId=a84a1276-1b8a-4217-b27c-b0904008edd8",
    "groupLink": "https://www.meetup.com/earth-sky-zen-dublin-dojo/"
  },
  {
    "groupName": "Wake Up Dublin - Mindfulness Practice",
    "eventTime": "2024-04-14T18:30:00+01:00",
    "eventDetails": "We are delighted to welcome you to this in-person sangha gathering. We come together to practice mindfulness in the Plum Village tradition. This Wake up Dublin sangha is aimed toward 18 - 35 year olds. During these regular meetups we may practice some of the following: 🧘‍♀️ 🧘‍♂️ Sitting meditation 🙌 Walking meditation/mindful movement 🤗 Connection exercises 😌 Deep relaxation 📖 Reading and discussion 🎶 Singing meditation ❤️ Dharma sharing We kindly invite you to join five minutes early so that we can have a mindful start to the evening together. Donations of €5 are welcome to cover the costs. We can only accept cash currently and thank you for your support. We look forward to seeing you there! Please update your RSVP if you can no longer attend ASAP to allow anyone on a waitlist the chance to join. Mats, cushions, and blankets are provided. Free on street parking just outside Oscailt. This event is organised on a voluntary basis and we welcome those who have attended the evening on a few occasions & are practicing in the Plum Village tradition to become involved and support the continuation of our Sangha.",
    "lat": 53.33286,
    "lon": -6.242129,
    "locationInfo": "Oscailt, 8 Pembroke Road, Dublin, Dublin",
    "eventName": "Evening of Mindfulness",
    "eventEndTime": "2024-04-14T20:30:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/wake-up-dublin/events/300286678/?recId=38617082-9729-47d2-9be4-f93f704ae2a7&recSource=ml-popular-events-nearby&searchId=a84a1276-1b8a-4217-b27c-b0904008edd8",
    "groupLink": "https://www.meetup.com/wake-up-dublin/"
  },
  {
    "groupName": "Bray Movement School",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "We're offering Free Trial Classes to anyone interested in joining the Bray Movement School. A school gives us the opportunity to come together as a collective with the dual objective of working on the material and working on ourselves. Through the group we give ourselves a chance to change, transform and most notably, provide a space to awaken and become conscious. A movement practice will provide the platform and broad range of material to contend with. In taking part in a movement school like this I’ll aim to teach material that will help you foster a lifelong movement practice that is independent in its own way and truly unique to you as an individual. We come together as a group to share that unique perspective and elevate our own understanding of movement as part of a community. The school will follow a curriculum based approach in exposing students to what I feel are fundamental practices (listed below) that relate to the field of movement. The teachings will be delivered in an organised, modular and process-based approach in order to present these various systems as a coherent body of knowledge. Website: ronanlewins.ie/movement-school-free-trial",
    "lat": 53.20498,
    "lon": -6.102161,
    "locationInfo": "Bray Bowl, Quinsborough Rd, Bray, Wicklow, al",
    "eventName": "Free Trial Class - Bray Movement School",
    "eventEndTime": "2024-04-15T19:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/f/9/2/600_520193138.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/meetup-group-nuvyerse/events/300313692/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/meetup-group-nuvyerse/"
  },
  {
    "groupName": "Explore the cities of UK and Ireland playing and learning",
    "eventTime": "2024-04-15T10:00:00+01:00",
    "eventDetails": "Have fun alone or make your team and start walking through Dublin's best attractions solving riddles! Learn interesting things about the city and the attractions! Play an app led city game ! Take your companion or meet new teammates and test your co operation skills! Book your game on https://worldcitytrail.com/product/dublin-scavenger-hunt ! Cost: 10 EUR (50%) off, only for this group's members, apply coupon: MTP50 in your cart page! Have fun !",
    "lat": 53.352562,
    "lon": -6.261485,
    "locationInfo": "Parnell Street, Dublin, D",
    "eventName": "Dublin scavenger hunt - Explore the city playing and learning!",
    "eventEndTime": "2024-04-15T12:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/e/a/f/600_496356527.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/explore-the-cities-of-u-k-playing-and-learning/events/300305737/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/explore-the-cities-of-u-k-playing-and-learning/"
  },
  {
    "groupName": "DUBLIN RUNNERS",
    "eventTime": "2024-04-15T18:30:00+01:00",
    "eventDetails": "Join us for a 9 or 10km run in the Phoenix Park. We commence running at 6:30pm SHARP. The pace will be approximately 5:20 min/km, and you will need to be able to run at this pace unless there are others clicked into the run who can run an alternative pace with you, as the park is now too dark to run alone in. Please wear hi vis and bring a head or chest light. We meet opposite the entrance to the Papal cross carpark, on the small side road. If you have any questions, please let me know, preferably in the comments section as sometimes I don’t see the messages in the group message section. Thanks Dayle",
    "lat": 53.356953,
    "lon": -6.324432,
    "locationInfo": "Acres Road, Dublin, D",
    "eventName": "Phoenix Park Evening Run",
    "eventEndTime": "2024-04-15T19:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/d/7/2/600_511672594.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/dublinrunners/events/299706831/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/dublinrunners/"
  },
  {
    "groupName": "Zumba with Karla B.",
    "eventTime": "2024-04-15T18:30:00+01:00",
    "eventDetails": "Just come prepared to dance, burn some calories and have a good time! Meet new people and friends for life ♥ Wear comfortable, sweat-appropriate clothes that are easy to move in as well as supportive runners. Don't forget to bring water and a towel! Feel free to bring your bestie (s) ♥",
    "lat": 53.350407,
    "lon": -6.270815,
    "locationInfo": "1 Green Street, Dublin 7, D",
    "eventName": "ZUMBA CLASS IN DUBLIN CITY CENRE *** OFF CAPEL STREET ***",
    "eventEndTime": "2024-04-15T19:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/a/c/0/c/600_516944044.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/zumba-with-karla-b/events/300033613/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/zumba-with-karla-b/"
  },
  {
    "groupName": "Board Games Ireland",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Small Meetup upstairs in Ryan's Bar. Please be aware that there is a very limited amount of reasonably sized tables. This is a casual meet up for people who want to play boardgames. Lots of people bring plenty of games and rules will always be explained so don't worry if you're new to the hobby and you don't have anything to bring along or think you won't know how to play. Check out the comments below where people will say what games they are bringing and express your interest in joining if interested.",
    "lat": 53.350273,
    "lon": -6.252936,
    "locationInfo": "19 Store Street, Dublin 1",
    "eventName": "Monday Night MeetUp",
    "eventEndTime": "2024-04-15T23:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/1/3/0/600_435844400.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/board-games-ireland/events/300032150/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/board-games-ireland/"
  },
  {
    "groupName": "Sult na Sollán - Ceol & Gaeilge",
    "eventTime": "2024-04-15T18:15:00+01:00",
    "eventDetails": "PILATES AS GAEILGE - Teagascóir / Instructor - Ally Doyle Bíonn pilates ar fheabhas do shláinte an choirp agus sláinte an intinne. Fág an strus sa bhaile agus bígí linn don seisiún seo. Mura bhfuil ach cúpla focal Ghaeilge - ná bí buartha - beidh fáilte romhat! SONRAÍ ● Cúrsa 8 sheachtain i Nás na Ríogh ● Gach Luan, 18.15 - 19.15 ● €80.00 an cúrsa ● Uasmhéid de deichniúr sa rang ● Is í Gaeilge teanga an ranga ● Fluent Irish not needed Cuir áit in áirithe | Reserve your place THE ALLYWAY FUNKTIONAL TRAINING Unit 2, Milbrook Industrial Estate, Nás na Ríogh 0857636126 theallywayft@gmail.com",
    "lat": 53.216213,
    "lon": -6.659443,
    "locationInfo": "Millbrook Industrial Estate, Naas",
    "eventName": "Pilates as Gaeilge",
    "eventEndTime": "2024-04-15T19:15:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/b/3/4/d/600_470625901.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/sult-na-sollan/events/300032063/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/sult-na-sollan/"
  },
  {
    "groupName": "Writing Hour Dublin",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "-First 5 minutes: meet and greet and say what you're going to be working on -50 minutes of quiet writing with microphone on mute. Feel free to go off-camera. -Last 5 minutes: come back and discuss as a group how we did Notes: -being on-camera is optional -no critiquing other people's writing, choice of subject, etc. unless specifically asked -have fun :)",
    "lat": "The latitude property does not exist.",
    "lon": "The longitude property does not exist.",
    "eventName": "Online Meet and Write!",
    "eventEndTime": "2024-04-15T21:00:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/writing-hour-dublin/events/300398671/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/writing-hour-dublin/"
  },
  {
    "groupName": "Mr.Child Fencing Club Kildare/Laois",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Junior fencing session suitable for age under 18. *important: please check our website www.mrchild.ie for details before RSVP * CMWS Hall, Kildare 18:00 – 20:00 Junior session (under 16's) 20:00 – 22:00 Adult session For fencers who doesn’t have their own equipment, you can rent set of gear from club (helmet, glove, jacket, sword, chest protector), so during rental period you are the owner of the gear and no one will share same equipment. Deposit: €200, yearly rental fee: €80 2. Beginner Class Beginner fencing program is 10 weeks continuous essential training. Ideally after the beginner training you are ready for fencing competitions. Fee: €100 3. Training Fee and Membership With increasing hall rental and club running cost, we have to increase our training fee and membership fee: Training Fee: €15 per visit. €200 for half year. €380 for year.",
    "lat": 53.155174,
    "lon": -6.912196,
    "locationInfo": "CMWS Hall, R51 WN51, Kildare",
    "eventName": "Junior Fencing Session",
    "eventEndTime": "2024-04-15T20:00:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/mrchild/events/300032061/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/mrchild/"
  },
  {
    "groupName": "Pilates as Gaeilge",
    "eventTime": "2024-04-15T18:15:00+01:00",
    "eventDetails": "PILATES AS GAEILGE - Teagascóir / Instructor - Ally Doyle Bíonn pilates ar fheabhas do shláinte an choirp agus sláinte an intinne. Fág an strus sa bhaile agus bígí linn don seisiún seo. Mura bhfuil ach cúpla focal Ghaeilge - ná bí buartha - beidh fáilte romhat! SONRAÍ ● Cúrsa 8 sheachtain i Nás na Ríogh ● Gach Luan, 18.15 - 19.15 ● €80.00 an cúrsa ● Uasmhéid de deichniúr sa rang ● Is í Gaeilge teanga an ranga ● Fluent Irish not needed Cuir áit in áirithe | Reserve your place THE ALLYWAY FUNKTIONAL TRAINING Unit 2, Milbrook Industrial Estate, Nás na Ríogh 0857636126 theallywayft@gmail.com",
    "lat": 53.216213,
    "lon": -6.659443,
    "locationInfo": "Millbrook Industrial Estate, Naas",
    "eventName": "Pilates as Gaeilge - The Allyway Funktional Training",
    "eventEndTime": "2024-04-15T19:15:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/7/9/8/6/600_474631110.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/pilates-as-gaeilge/events/300032062/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/pilates-as-gaeilge/"
  },
  {
    "groupName": "Social ⚽⚽⚽⚽ & 🍺 after",
    "eventTime": "2024-04-15T18:50:00+01:00",
    "eventDetails": "Very chill social mixed football-all levels welcome. With the emphasis on fun & meeting new people, football is also a great way to get fit and stay health. You can send money on Revolut with this username:@sean7btk or https://paypal.me/hemish16?country.x=IE&locale.x=en_US Last minute cancellations removed from the meetup. Only positive encouragement allowed-no giving out / moaning. No rough tackling. No goalkeepers ''fly keeper / last person back''-change ever 5 minutes. Please ''Leave no Trace'' with plastic bottles etc.",
    "lat": 53.339184,
    "lon": -6.286385,
    "locationInfo": "Marrowbone Lane, Dublin 8, D",
    "eventName": "Social ⚽⚽⚽⚽ ",
    "eventEndTime": "2024-04-15T20:20:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/b/1/600_502560689.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/dublin-city-football/events/300294807/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/dublin-city-football/"
  },
  {
    "groupName": "Yoga with Reiki - Karina Rodrigues Connection",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "✨My yoga classes are gentle movements with a focus on breathing and bringing a connection with the body differently. The classes will have 90 minutes, so we can enter a little deeper into ourselves on the mat and bring outside our vitality and connection. ✨In each class, we'll embrace a different perspective of ourselves and bring it to life. My classes are designed to give you the tools to feel self-empowered and align to the feelings of peace, positivity, and self-empowerment, to listen to your body, to respect your body, and to embody different feelings that you have. ✨What my classes will bring to you? Connection, healing, happiness, positivity, and well-being, removing feelings of anger, stress, fear, negativity, and frustration so you open space in your life for confidence, self-esteem, self-worth, and self-love, you are important. We'll start with breathing techniques, Reiki, Asanas, mantras, meditation, and then Shavasana and end oracle card to guide you with some message. What to bring: ✨Open heart ✨yoga mat ✨ water bottle ✨ wear comfortable clothes ✨ Notebook if have any insight or ideas The exchange: First-class €15 4 classes are €65 Drop in €18 To Book your class or individual session you must go on this for the payment link. https://app.ubindi.com/Karina.Rodrigues.da.Silva Or pay by REvolut @karinaconnection (but you have to message me so I can know you are making the payment through Revolut) Any questions: https://wa.me/message/WJ777TLLCNDRC1 BENEFITS: Breathing techniques: Improves blood circulation, helps with anger, boosts immunity, helps manage Symptoms of Depression and Anxiety, reduces tension to Help With Headaches, and calms our emotions. Reiki: Increases energy, Promotes relaxation, focus, and clarity of mind, Enhances self-confidence, Improves grieving, accelerates the healing process after injuries and surgery, and helps to maintain health and well-being. Asanas: Practising yoga helps control an individual’s mind, body, and soul. It brings together physical and mental disciplines to achieve a peaceful body and mind; it helps manage stress and anxiety and keeps you relaxed. Yoga also helps in increasing flexibility, muscle strength, and body tone. It improves respiration, energy, and vitality. Practicing asanas might seem like just stretching, but it can do much more for your body from the way you feel, look, and move. Yoga guides you to a deep connection with your inner self, body, and the divine. Mantras: Mantra is a Sanskrit term, with “man” meaning “mind” and “tra” meaning “release.” Think of a mantra — a word or phrase you repeat during meditation — as a tool to help release your mind. It can make a lot of difference, especially if you have trouble concentrating or getting in the right frame of mind. Meditation: Gaining a new perspective on stressful situations, building skills to manage your stress, increasing self-awareness, focusing on the present, reducing negative emotions, increasing imagination and creativity, and increasing patience and tolerance. Shavasana: Calms the central nervous system, aiding the digestive and immune systems.Calms the mind and reduces stress and anxiety, helps lower blood pressure, and promotes spiritual awakening and awareness of higher consciousness. ✨Learn how your body is communicating with you all the time, you just need to be willing to start this new healing journey! ✨Be responsible for your BODY, for your LIFE. ✨Learn to listen to yourself, to respect yourself, to forgive and thus become emotionally stronger and no longer feel pain. ✨ Come and talk to me, I'm with my heart open to listen to you, let's find the best way to navigate your body's memories, pain, or emotions, walking together to discover the emotional and affective cause, strengthening you're throughout the process of connecting with your true self. ♥️ Love and gratitude ♥️ Karina Rodrigues Connection Contact: 089.9692341 Instagram:https://www.instagram.com/p/Cj1Idf3rdgm/?igshid=YmMyMTA2M2Y=",
    "lat": 53.345459,
    "lon": -6.266238,
    "locationInfo": "12 Wellington quay, Dublin ",
    "eventName": "✵ 𝕐𝕠𝕘𝕒 𝕨𝕚𝕥𝕙 ℝ𝕖𝕚𝕜𝕚 𝕋𝕖𝕞𝕡𝕝𝕖 𝔹𝕒𝕣 ✵",
    "eventEndTime": "2024-04-15T19:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/5/a/e/600_517474222.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/yoga-with-reiki-karina-rodrigues-connection/events/300032260/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/yoga-with-reiki-karina-rodrigues-connection/"
  },
  {
    "groupName": "Dublin Retreats & Spiritual Growth",
    "eventTime": "2024-04-15T19:00:00+02:00",
    "eventDetails": "All volunteer workers welcome, if you are a good organiser, looking for ways to spend your free time, enjoy meeting & arranging outings with other team organisers, this church group could use your help Coffee and tea available 🍵 Looking forward to seeing new faces. Relevant Links: http://www.legionofmary-deusetpatria.com/ https://youtube.com/watch?v=zX4qVm_biAE&feature=share",
    "lat": 53.342072,
    "lon": -6.260833,
    "locationInfo": "Clarendon Street, Dublin, D",
    "eventName": "Christian Prayer group, volunteer workers",
    "eventEndTime": "2024-04-15T20:30:00+02:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/dublin-retreats-spiritual-growth/events/300031924/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/dublin-retreats-spiritual-growth/"
  },
  {
    "groupName": "Dublin Zumba & Yoga Meetup Group",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Are you looking to develop or enhance your yoga practice and improve your health and well-being? Then you are going to love our Fuego Flow Yoga classes! They are the perfect mix of balance & flexibility, strength & relaxation. Whether you are new to yoga or have been practicing for years, you will find something to suit your level and interest. Expect a dynamic yoga class, a fusion of Hatha, Vinyasa, and Power yoga, offering an energizing and mindful experience that leaves you feeling invigorated. This class focuses on building strength, increasing flexibility, fostering mind-body connection, and cultivating mindfulness while providing a satisfying challenge for your body. Suitable for all levels Theme of this class: Balance and Bone Health This session emphasizes balance poses that enhance bone health and stability. By improving balance, you reduce the risk of falls and fractures. Additionally, these poses engage weight-bearing bones, which can help prevent conditions like osteoporosis. Join us every Tuesday at 7pm at The Carmelite Community Centre, 56 Aungier St, Dublin 2, D02 T258 Yoga instructor for this session: Hanna Book your class directly on our website fuegoflow.ie We offer a variety of pricing options. You can get a single class, a pack of 5/10 or one of the unlimited plans. We are also currently offering all you can eat Zumba & Yoga taster month for 50% off for €74.5. You can select the \"Unlimited 1 month Zumba and Yoga pass\" HERE. Use the code TASTER-MONTH during checkout to apply the discount. Please BYOM (Bring Your Own Mat) and be sure to arrive 10 min before the class so you have time to get set up. 🧘We can’t wait to see you on the mat 🧘",
    "lat": 53.34013,
    "lon": -6.266017,
    "locationInfo": "56 Aungier Street, Dublin 2, D",
    "eventName": "Yoga Class with Fuego Flow (theme: Balance and Bone Health)",
    "eventEndTime": "2024-04-15T19:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/2/8/7/600_516593895.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/fuego-flow/events/300032368/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/fuego-flow/"
  },
  {
    "groupName": "Dublin In4squash LGBTQ+ Meetup Group",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "This squash session for our In4Squash regular members. If you haven't played squash before, please join us for our beginner’s night on the first Monday of each month. Cost will be €7 per person supplemented by Irish Squash to cover cost of courts / facilities and payment will be needed by Revolut. Revolut Lorcan at 086 176 5577 noting the date of the squash session and comment below the event. Changing and shower facilities available. Please arrive 10 mins early as these are new facilities and we will need to arrange access. Following squash we will toast the new venue in one of the TCD local pubs or the Pav. Exciting times!!",
    "lat": 53.345108,
    "lon": -6.255296,
    "locationInfo": "Printing House Square, Trinity College Dublin,, Dublin",
    "eventName": "In4Squash session: regular attendees (LGBTQ+)",
    "eventEndTime": "2024-04-15T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/e/e/600_501900238.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/dublin-in4squash-meetup-group/events/300145145/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/dublin-in4squash-meetup-group/"
  },
  {
    "groupName": "Jugozapadni Slaveni",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Najstariji Pub u Dublinu, utemeljen 1198 godine. Živa glazba. Irska naravno",
    "lat": 53.344913,
    "lon": -6.276294,
    "locationInfo": "20 Bridge Street Lower, Dublin D8",
    "eventName": "Devetnaesto druzenje ",
    "eventEndTime": "2024-04-15T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/4/2/c/8/600_518837096.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/jugoisto%C4%8Dni-slaveni/events/298914862/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/jugoistočni-slaveni/"
  },
  {
    "groupName": "Improv Comedy Dublin - The Playground",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "The Playground is back with its weekly drop-in improv workshop! Running on Monday evenings, this is a chance to experience improv among like minded people. No experience necessary and all levels are welcome! Each week we will have a different theme with exercises and activities to allow us improve our improv skills. Whether you are interested in developing the skills for your professional or personal life, or you are someone who currently performs or would like to perform on stage, then there is something for everyone. The longer term objective of The Playground is to create a place for people to develop and create projects and shows, providing regular opportunities for those who wish to perform in shows. Facilitated by two very experienced improvisers, Neil Curran and Quinton O'Reilly, join us for some play! We also have guest teachers join us too * Each drop in session lasts 2 hours and starts at 7pm in the Teacher's Club. * Each drop in costs just €12. * You can also sign up for membership which costs just €30 per calendar month and gets you access to all workshops. * No experience necessary and all levels welcome. * Events run on a drop in basis offering flexibility for those who can't commit to doing a course. * Payment can be made on arrival. For more about Neil Curran please visit www.lowerthetone.com Check us out on Instagram here: https://www.instagram.com/improv_playground/",
    "lat": 53.35313,
    "lon": -6.265158,
    "locationInfo": "36 Parnell Square West, Dublin 1, D",
    "eventName": "The Playground: Weekly Improv Drop In Event",
    "eventEndTime": "2024-04-15T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/8/6/8/600_515470344.webp?w=750",
    "eventType": "Cultural",
    "eventUrl": "https://www.meetup.com/improv-comedy-dublin/events/299816579/?recId=f89fe5cf-73e5-4992-9066-30767e9b8c5c&recSource=ml-popular-events-nearby&searchId=10649df1-ba63-46cf-af8d-e819b18282d1",
    "groupLink": "https://www.meetup.com/improv-comedy-dublin/"
  },
  {
    "groupName": "Sober Events ~ Dublin",
    "eventTime": "2024-04-15T19:30:00+01:00",
    "eventDetails": "Indulge in calming teas and snacks while engaging in lively conversations with other artists. As you mingle, exchange experiences and wisdom, fostering a supportive atmosphere aimed at unleashing boundless creativity. This is an opportunity for you to work on your own art piece as well as being surrounded by like minded artists. While we provide the essentials such as paper and brushes, we encourage you to bring your own art supplies to enhance your creative journey. Embrace the opportunity to personalize your artistic process and delve deeper into your unique expression. Tickets sold HERE to secure your spot or pay at the door Through curated activities and meaningful discussions, you'll delve into the heart of your creative challenges. By sharing insights and strategies with your peers, you'll uncover innovative ways to overcome artistic hurdles. Join us in breaking through the barriers of creative block and nurturing a vibrant community of artists.",
    "lat": 53.346085,
    "lon": -6.262688,
    "locationInfo": "51 Wellington Quay, Temple Bar, Dublin",
    "eventName": "Art Block Unlocked: Break Through Creativity Barriers",
    "eventEndTime": "2024-04-15T21:45:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/3/0/2/b/600_519432331.webp?w=750",
    "eventType": "Cultural",
    "eventUrl": "https://www.meetup.com/sober-events-dublin/events/300034022/?recId=f89fe5cf-73e5-4992-9066-30767e9b8c5c&recSource=ml-popular-events-nearby&searchId=10649df1-ba63-46cf-af8d-e819b18282d1",
    "groupLink": "https://www.meetup.com/sober-events-dublin/"
  },
  {
    "groupName": "GoodRec Play Football in Dublin Everyday",
    "eventTime": "2024-04-15T17:00:00+01:00",
    "eventDetails": "To play in this game you MUST sign up in the GoodRec App here: https://goodrec.onelink.me/59V5/meetup3 ⚠️If you don’t do this step you will not have a spot reserved⚠️ We organize games every day across the city! Indoor and outdoor, social and competitive. Choose any game you want from Monday - Sunday. Follow our Instagram to see game photos & videos: @goodrecsports Any questions, message us on the app or IG !",
    "lat": 53.339531,
    "lon": -6.230142,
    "locationInfo": "South Lotts Road, Dublin 4, D",
    "eventName": "6v6 Outdoor game @ SportsCo⚽Check Description ⬇️",
    "eventEndTime": "2024-04-15T18:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/a/e/5/600_519591941.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/goodrec-play-football-in-dublin/events/300311921/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/goodrec-play-football-in-dublin/"
  },
  {
    "groupName": "Dublin Free Tours",
    "eventTime": "2024-04-15T11:00:00+01:00",
    "eventDetails": "You'll meet your local guide at the meeting point a little before 11AM and show your booking. Then we'll commence a fascinating walking tour through the streets, sights, and sounds of Dublin old and new. You'll get an unrivalled insight to the history and culture that has shaped the capital you see today - warts and all, discover the lesser-known, intriguing oddities of our city, and get unique insider tips for the rest of your stay. Sites and topics covered include: Dublin Castle, Christchurch, Viking & Medieval Dublin, Temple Bar, fables, folklore and mythology, Trinity College, Stephen's Green, risings and rebellions, writers & rogues and so, so much more... please remember, places are limited and you must book your spot via: https://www.generationtours.com/dublin See you soon!",
    "lat": 53.345177,
    "lon": -6.262646,
    "locationInfo": "3 Crown Alley, Dublin, D",
    "eventName": "Dublin Free Tour - essentials & oddities",
    "eventEndTime": "2024-04-15T14:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/a/c/7/600_500855527.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/dublin-free-tours/events/300306228/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/dublin-free-tours/"
  },
  {
    "groupName": "Dublin Buddhist Centre",
    "eventTime": "2024-04-15T07:30:00+01:00",
    "eventDetails": "These events are suitable for those who already have a regular meditation practice and want to continue to do so in a supportive environment with other meditators. There is no requirement to book in advance, just turn up, or log in. For online sits, please click the link below a few minutes before each sit. Join the morning meditations each day using Zoom (password if required is dropinmed ). On a donation basis. No need to book, just drop in if you know how to meditate.",
    "lat": 53.351986,
    "lon": -6.253541,
    "locationInfo": "James Joyce Street, Dublin, D",
    "eventName": "Drop In Morning Meditation (In person and Online)",
    "eventEndTime": "2024-04-15T08:25:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/7/d/5/5/600_515492085.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/dublin-buddhist-centre-sangha-nights/events/300024008/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/dublin-buddhist-centre-sangha-nights/"
  },
  {
    "groupName": "Stefano Argentine Tango, Dublin Tango School",
    "eventTime": "2024-04-15T18:30:00+01:00",
    "eventDetails": "Hi Everyone! Hola! Ciao! Every Monday 18.30 class for absolute beginner, 19.30 for advanced and 20.30 for intermediate dancer 21.30 onwards we have social dance / practice. For Beginner or absolute beginner: no partner and no experience needed. Don't be nervous! 🙂 ... Our classes are fun and exciting - and we're very warm and welcoming 😉 • Experienced teachers. • Attentive, personal tuition. IMPORTANT:- TRAINERS and RUBBER SOLES are NOT suitable for Tango CLASS PRICES with online booking at dublintangoschoo.com https://www.dublintangoschool.com/dublin-tango-school-event-page €13 with loyalty card (6 classes for 78euro) €15 1 classes €20 2 classes in the same day €25 3 classes in the same day PRIVATE TUITION ALSO AVAILABLE. Join our FB group Facebook:- https://www.facebook.com/mytangoforyou/ NB:- to be sure you are always notified of upcoming events, festivals or any schedule changes check out our Facebook page:- Dublin Tango School (That's where we attract most of our attendees) If you prefer to receive information by email just mail me at TangoDublinSchool@gmail.com See you Monday!! Stefano",
    "lat": 53.344807,
    "lon": -6.26579,
    "locationInfo": "Sycamore Building, Sycamore Street, Temple Bar, Dublin",
    "eventName": "Tango Lessons for Beginners - Prepare to meet new people & dance!",
    "eventEndTime": "2024-04-15T21:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/7/0/5/600_486175045.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/stefano-tango-dublin/events/300034014/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/stefano-tango-dublin/"
  },
  {
    "groupName": "Fáilte Swing Dance Group",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "Join us as we step back into the raucous swing dancing era of the 1930’s. SCHEDULE: 7pm - 7:50pm Intermediate Swing Dance Class. Admission €10 per person. 7:50pm - 8:40pm Beginner Solo Jazz Class. Admission €10 per person. 8:40pm - 9:30pm Beginner Swing Dance Class. Admission €10 per person. 9:30pm - 10:00pm Social Dance & Jazz Jam. Free Entry. CLASS DETAILS: FREE SOCIAL DANCE & JAZZ JAM DETAILS: WHAT OTHER EVENTS ARE COMING UP: WHAT TO BRING:",
    "lat": 53.336777,
    "lon": -6.26388,
    "locationInfo": "11 Montague Lane, Dublin, D",
    "eventName": "Monday Swing Dance Social & Jazz Jam ",
    "eventEndTime": "2024-04-15T22:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/7/4/5/600_518546437.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/failte-swing-dance-group/events/300035369/?recId=fd3b9f5e-bd00-475e-80f0-e45e1f4c2381&recSource=ml-popular-events-nearby&searchId=40fc3fb1-f151-4c3a-ba8c-ea9f5dd55aae",
    "groupLink": "https://www.meetup.com/failte-swing-dance-group/"
  },
  {
    "groupName": "Addictive Eaters Anonymous Dublin",
    "eventTime": "2024-04-15T19:30:00+01:00",
    "eventDetails": "Do you suffer from anorexia, bulimia, obesity, binge eating, or undereating? Are you sick of trying to control your eating? Is your obsession with food taking over your life? Addictive Eaters Anonymous (AEA) is a worldwide Twelve Step fellowship based on Alcoholics Anonymous. AEA members have found recovery from binge eating, anorexia, bulimia, other forms of addictive eating and compulsive exercise. Through working the Twelve Steps of AEA, members find peace of mind and the ability to live a meaningful and productive life. Wherever you are, whatever your problem with food, AEA can help. AEA meeting every Monday evening 7.30pm - 8.30pm in Dublin. There are no fees and everyone is welcome. Please contact us for meeting venue details. Phone: +353 1 554 9725 Email: contact@aeairl.org Website: www.addictiveeatersanonymous.org Please visit our website for weekly online meetings.",
    "lat": "The latitude property does not exist.",
    "lon": "The longitude property does not exist.",
    "eventName": "Addictive Eaters Anonymous Dublin",
    "eventEndTime": "2024-04-15T20:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/8/4/2/600_506734882.webp?w=750",
    "eventType": "Charity",
    "eventUrl": "https://www.meetup.com/addictive-eaters-anonymous-dublin/events/300033993/?recId=d7d07b2c-7806-4c44-9d06-c0d416a19673&recSource=ml-popular-events-nearby&searchId=91288949-d25b-4127-bd3d-bfc91828c69a",
    "groupLink": "https://www.meetup.com/addictive-eaters-anonymous-dublin/"
  },
  {
    "groupName": "Bray Movement School",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "We're offering Free Trial Classes to anyone interested in joining the Bray Movement School. A school gives us the opportunity to come together as a collective with the dual objective of working on the material and working on ourselves. Through the group we give ourselves a chance to change, transform and most notably, provide a space to awaken and become conscious. A movement practice will provide the platform and broad range of material to contend with. In taking part in a movement school like this I’ll aim to teach material that will help you foster a lifelong movement practice that is independent in its own way and truly unique to you as an individual. We come together as a group to share that unique perspective and elevate our own understanding of movement as part of a community. The school will follow a curriculum based approach in exposing students to what I feel are fundamental practices (listed below) that relate to the field of movement. The teachings will be delivered in an organised, modular and process-based approach in order to present these various systems as a coherent body of knowledge. Website: ronanlewins.ie/movement-school-free-trial",
    "lat": 53.20498,
    "lon": -6.102161,
    "locationInfo": "Bray Bowl, Quinsborough Rd, Bray, Wicklow, al",
    "eventName": "Free Trial Class - Bray Movement School",
    "eventEndTime": "2024-04-15T19:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/f/9/2/600_520193138.webp?w=750",
    "eventType": "Education",
    "eventUrl": "https://www.meetup.com/meetup-group-nuvyerse/events/300313692/?recId=166b5ad6-24e6-4f20-8852-6cb3ba713fb7&recSource=ml-popular-events-nearby&searchId=d1f9ecd8-10e9-4d0d-ab46-cbdba573d274",
    "groupLink": "https://www.meetup.com/meetup-group-nuvyerse/"
  },
  {
    "groupName": "Tog Hackerspace",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "These are our regular Monday evening electronics nights. Everyone from absolute beginner to experienced is welcome. These evenings are not classes or tutorials, rather a very friendly informal evening. We have a wide range of people who come. Some are absolute beginners who do not even work or study electronics, but are interested to know more. Others have something that they are already working on. We almost always have some first time visitors and we always give them a tour of the space. Come in with your Pi, Arduino, or whatever you have. Bring your laptop. Maybe you want to make something, solder, breadboard or use our electronic gear. Maybe you have some vague ideas and just want to get started. Or maybe you’re just curious……if so, it’s fine to come along and just see what others are doing. If you would like to get even more involved and have the full use of our space, we would be delighted to have you as a full member. Membership brings many benefits. We are located behind Mr Price and the Bright Lights store on Kylemore Road. We have lots of free parking available.",
    "lat": 53.33013,
    "lon": -6.34628,
    "locationInfo": "Kylemore Road, Dublin 12, D",
    "eventName": "Electronics Night",
    "eventEndTime": "2024-04-15T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/5/7/c/4/600_502102468.webp?w=750",
    "eventType": "Education",
    "eventUrl": "https://www.meetup.com/tog-dublin-hackerspace/events/299007263/?recId=319a1c34-fdfb-412f-a04e-ae1de7c44b8b&recSource=ml-popular-events-nearby&searchId=6a7b80a4-7464-4018-af22-5bb6d3a3f272",
    "groupLink": "https://www.meetup.com/tog-dublin-hackerspace/"
  },
  {
    "groupName": "Dance Workshop",
    "eventTime": "2024-04-15T20:00:00+01:00",
    "eventDetails": "Join us for the grand final of Ceol na Cathrach (Music of the City) celebrating Dublin's traditional musicians. This event will bring together in one stage the talented musicians from The Annesley House performances, showcasing their passion for Irish music in both English and Irish. Don't miss The Big Gig in Dublin's heart!",
    "lat": 53.366085,
    "lon": -6.263964,
    "locationInfo": "St. Columba's Church North Strand,, Dublin",
    "eventName": "CRADICIONAL IRISh COCISIC:\nChe BIG GIG",
    "eventEndTime": "2024-04-15T22:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/9/8/0/600_520330624.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/meetup-group-cstgommv/events/300351164/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/meetup-group-cstgommv/"
  },
  {
    "groupName": "Dublin Zumba & Yoga Meetup Group",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Are you looking to develop or enhance your yoga practice and improve your health and well-being? Then you are going to love our Fuego Flow Yoga classes! They are the perfect mix of balance & flexibility, strength & relaxation. Whether you are new to yoga or have been practicing for years, you will find something to suit your level and interest. Expect a dynamic yoga class, a fusion of Hatha, Vinyasa, and Power yoga, offering an energizing and mindful experience that leaves you feeling invigorated. This class focuses on building strength, increasing flexibility, fostering mind-body connection, and cultivating mindfulness while providing a satisfying challenge for your body. Suitable for all levels Theme of this class: Balance and Bone Health This session emphasizes balance poses that enhance bone health and stability. By improving balance, you reduce the risk of falls and fractures. Additionally, these poses engage weight-bearing bones, which can help prevent conditions like osteoporosis. Join us every Tuesday at 7pm at The Carmelite Community Centre, 56 Aungier St, Dublin 2, D02 T258 Yoga instructor for this session: Hanna Book your class directly on our website fuegoflow.ie We offer a variety of pricing options. You can get a single class, a pack of 5/10 or one of the unlimited plans. We are also currently offering all you can eat Zumba & Yoga taster month for 50% off for €74.5. You can select the \"Unlimited 1 month Zumba and Yoga pass\" HERE. Use the code TASTER-MONTH during checkout to apply the discount. Please BYOM (Bring Your Own Mat) and be sure to arrive 10 min before the class so you have time to get set up. 🧘We can’t wait to see you on the mat 🧘",
    "lat": 53.34013,
    "lon": -6.266017,
    "locationInfo": "56 Aungier Street, Dublin 2, D",
    "eventName": "Yoga Class with Fuego Flow (theme: Balance and Bone Health)",
    "eventEndTime": "2024-04-15T19:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/2/8/7/600_516593895.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/fuego-flow/events/300032368/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/fuego-flow/"
  },
  {
    "groupName": "Dublin Dance co-op",
    "eventTime": "2024-04-15T19:45:00+01:00",
    "eventDetails": "www.dublindancecoop.com for more info! Every Monday at 7.45 in the F2 Rialto. 12 euros. All Welcome. Freeform dancing, stretching, rolling around and playing with anything dance related. No experience necessary!",
    "lat": 53.337223,
    "lon": -6.293315,
    "locationInfo": "3 Reuben Plaza, Dublin, D",
    "eventName": "Dublin Dance Co-op",
    "eventEndTime": "2024-04-15T21:45:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/dublin-dance-co-op/events/300035267/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/dublin-dance-co-op/"
  },
  {
    "groupName": "Stefano Argentine Tango, Dublin Tango School",
    "eventTime": "2024-04-15T18:30:00+01:00",
    "eventDetails": "Hi Everyone! Hola! Ciao! Every Monday 18.30 class for absolute beginner, 19.30 for advanced and 20.30 for intermediate dancer 21.30 onwards we have social dance / practice. For Beginner or absolute beginner: no partner and no experience needed. Don't be nervous! 🙂 ... Our classes are fun and exciting - and we're very warm and welcoming 😉 • Experienced teachers. • Attentive, personal tuition. IMPORTANT:- TRAINERS and RUBBER SOLES are NOT suitable for Tango CLASS PRICES with online booking at dublintangoschoo.com https://www.dublintangoschool.com/dublin-tango-school-event-page €13 with loyalty card (6 classes for 78euro) €15 1 classes €20 2 classes in the same day €25 3 classes in the same day PRIVATE TUITION ALSO AVAILABLE. Join our FB group Facebook:- https://www.facebook.com/mytangoforyou/ NB:- to be sure you are always notified of upcoming events, festivals or any schedule changes check out our Facebook page:- Dublin Tango School (That's where we attract most of our attendees) If you prefer to receive information by email just mail me at TangoDublinSchool@gmail.com See you Monday!! Stefano",
    "lat": 53.344807,
    "lon": -6.26579,
    "locationInfo": "Sycamore Building, Sycamore Street, Temple Bar, Dublin",
    "eventName": "Tango Lessons for Beginners - Prepare to meet new people & dance!",
    "eventEndTime": "2024-04-15T21:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/7/0/5/600_486175045.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/stefano-tango-dublin/events/300034014/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/stefano-tango-dublin/"
  },
  {
    "groupName": "Irish Social Dancing: Set Dancing and Sean Nós",
    "eventTime": "2024-04-15T19:15:00+01:00",
    "eventDetails": "Hello all! My name is Louise O Connor. Im a fiddle player and dancer from County Clare and I love teaching the Irish dances I grew up doing back home. You're very welcome to join us for social dancing in the Backroom of The Cobblestone starting again January 15th at 7.15pm. It is very relaxed and informal and always great fun. The dancers that have come so far have all gotten to know each other which is lovely. They have been locals as well as people coming from different countries. Booking link is here: www.louise.ie/beginners Ill be teaching set dancing which is an traditional Irish social dance. You do not need a partner to attend and all levels of dancers are welcome. We will dance a different set each night. If you are already familiar with the sets you can still enjoy dancing through the sets. We will learn the Plain, Ballyvourney Jig, Kilfenora amongst others. You can of course carry on the night in The Cobblestone Pub after where there is always brilliant live music playing. I will also be organising some live music Céilí or party events. The next one will be on January 28th in the Grand Social. All the info is here: www.louise.ie/areyadancin We'll have a live band and Irish College style dances instructed in both English and Irish",
    "lat": 53.349808,
    "lon": -6.277836,
    "locationInfo": "77 King Street North, Dublin, D",
    "eventName": "Beginners Irish Social Dancing in The Cobblestone Pub: Set Dancing ",
    "eventEndTime": "2024-04-15T20:15:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/6/1/a/600_506426138.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/irish-social-dancing-set-dancing/events/299894526/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/irish-social-dancing-set-dancing/"
  },
  {
    "groupName": "Fáilte Swing Dance Group",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "Join us as we step back into the raucous swing dancing era of the 1930’s. SCHEDULE: 7pm - 7:50pm Intermediate Swing Dance Class. Admission €10 per person. 7:50pm - 8:40pm Beginner Solo Jazz Class. Admission €10 per person. 8:40pm - 9:30pm Beginner Swing Dance Class. Admission €10 per person. 9:30pm - 10:00pm Social Dance & Jazz Jam. Free Entry. CLASS DETAILS: FREE SOCIAL DANCE & JAZZ JAM DETAILS: WHAT OTHER EVENTS ARE COMING UP: WHAT TO BRING:",
    "lat": 53.336777,
    "lon": -6.26388,
    "locationInfo": "11 Montague Lane, Dublin, D",
    "eventName": "Monday Swing Dance Social & Jazz Jam ",
    "eventEndTime": "2024-04-15T22:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/7/4/5/600_518546437.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/failte-swing-dance-group/events/300035369/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/failte-swing-dance-group/"
  },
  {
    "groupName": "Board Games Ireland",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Small Meetup upstairs in Ryan's Bar. Please be aware that there is a very limited amount of reasonably sized tables. This is a casual meet up for people who want to play boardgames. Lots of people bring plenty of games and rules will always be explained so don't worry if you're new to the hobby and you don't have anything to bring along or think you won't know how to play. Check out the comments below where people will say what games they are bringing and express your interest in joining if interested.",
    "lat": 53.350273,
    "lon": -6.252936,
    "locationInfo": "19 Store Street, Dublin 1",
    "eventName": "Monday Night MeetUp",
    "eventEndTime": "2024-04-15T23:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/1/3/0/600_435844400.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/board-games-ireland/events/300032150/?recId=b0c52a67-039f-4c78-8590-6ea6c478f34a&recSource=ml-popular-events-nearby&searchId=d4a0f874-365f-45ce-9c62-068011e526ff",
    "groupLink": "https://www.meetup.com/board-games-ireland/"
  },
  {
    "groupName": "The Clockwork Door's Sober Events in Dublin!",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "Indulge in calming teas and snacks while engaging in lively conversations with other artists. As you mingle, exchange experiences and wisdom, fostering a supportive atmosphere aimed at unleashing boundless creativity. This is an opportunity for you to work on your own art piece as well as being surrounded by like minded artists. While we provide the essentials such as paper and brushes, we encourage you to bring your own art supplies to enhance your creative journey. Embrace the opportunity to personalize your artistic process and delve deeper into your unique expression. Tickets sold HERE to secure your spot or pay at the door Through curated activities and meaningful discussions, you'll delve into the heart of your creative challenges. By sharing insights and strategies with your peers, you'll uncover innovative ways to overcome artistic hurdles. Join us in breaking through the barriers of creative block and nurturing a vibrant community of artists.",
    "lat": "The latitude property does not exist.",
    "lon": "The longitude property does not exist.",
    "eventName": "Art Block Unlocked: Break Through Creativity Barriers",
    "eventEndTime": "2024-04-15T21:45:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/3/0/7/0/600_519432400.webp?w=750",
    "eventType": "Entertainment",
    "eventUrl": "https://www.meetup.com/clockworkdoorevents/events/300034021/?recId=b0c52a67-039f-4c78-8590-6ea6c478f34a&recSource=ml-popular-events-nearby&searchId=d4a0f874-365f-45ce-9c62-068011e526ff",
    "groupLink": "https://www.meetup.com/clockworkdoorevents/"
  },
  {
    "groupName": "Dublin Social Meet up",
    "eventTime": "2024-04-14T19:00:00+01:00",
    "eventDetails": "a bi weekly event for bi weekly bunch of anime crackheads as we appreciate some Japanese animation. Don't forget to rsvp a spot on our website @https://meetu.ps/e/McTys/zXNq6/i If you have any questions regarding the meetups please let me know in the comments below or private message. if you can't seem to make it please update your rsvp. Thank You. 1st anime Ninja Kamui 2 episodes Mr. Villain's Day Off 2 episodes",
    "lat": 53.345947,
    "lon": -6.263047,
    "locationInfo": "51 Wellington Quay, Temple Bar, Dublin, D02 NH04,, Dublin ",
    "eventName": "Anime meetup ",
    "eventEndTime": "2024-04-14T21:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/f/f/f/600_520313247.webp?w=750",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/meetup-group-wasoxmgr/events/300332463/?recId=e05be11b-d192-43a3-9901-fd3a93f97fbb&recSource=ml-popular-events-nearby&searchId=6fb5c5dc-5784-4d1e-902e-07f41edcc4a1",
    "groupLink": "https://www.meetup.com/meetup-group-wasoxmgr/"
  },
  {
    "groupName": "Dublin Friendly Hangouts",
    "eventTime": "2024-04-14T14:00:00+01:00",
    "eventDetails": "This time we are gathering on Sunday at 2 pm in Clockwork Door in Temple Bar, This time we are taking advantage of a long day to play longer and more complicated games such as Catan, Carcassonne etc. Join us if you want to dive deep into the board games world! You’re more than welcome to bring your own games. Our event is free but this place doesn't serve any drinks or food but they have a kitchen where you can grab a cup of coffee and snacks. They work on pay-per-minute basis, for one hour 6 euro, but we asked them to not to charge us more than 12eur no matter much longer you stay. See you there 👍",
    "lat": 53.3461,
    "lon": -6.26269,
    "locationInfo": "51 Wellington Quay, Dublin, D",
    "eventName": "Board Games and Fun Sunday ",
    "eventEndTime": "2024-04-14T18:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/a/0/0/e/600_515200974.webp?w=750",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/dublin-friendly-hangouts/events/300336436/?recId=e05be11b-d192-43a3-9901-fd3a93f97fbb&recSource=ml-popular-events-nearby&searchId=6fb5c5dc-5784-4d1e-902e-07f41edcc4a1",
    "groupLink": "https://www.meetup.com/dublin-friendly-hangouts/"
  },
  {
    "groupName": "Social Events",
    "eventTime": "2024-04-14T14:00:00+01:00",
    "eventDetails": "If you love cherry blossoms, you won’t want to miss this event at the park. Free, but ticket required. Click here to reserve your spot. Enjoy the stunning scenery of pink and white blooms along the tree-lined paths, and capture the perfect shots for your Instagram feed. You can also sample delicious food from the market stalls, and chat with fellow cherry blossom enthusiasts. Don’t miss this chance to experience the park’s cherry blossom bonanza. 🌸 Here are some friendly notes for you: Don’t forget to register here to secure your spot; otherwise, you won’t be able to attend (limited spots). Please sign up, spread the word, and see you on the day! 🎉",
    "lat": 53.32714,
    "lon": -6.236056,
    "locationInfo": "Herbert Park, Dublin, D",
    "eventName": "Instagram-Worthy Cherry Blossom Bonanza: Food, Photos, and Fun",
    "eventEndTime": "2024-04-14T16:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/6/0/9/600_513054793.webp?w=750",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/socialevents/events/299314513/?recId=e05be11b-d192-43a3-9901-fd3a93f97fbb&recSource=ml-popular-events-nearby&searchId=6fb5c5dc-5784-4d1e-902e-07f41edcc4a1",
    "groupLink": "https://www.meetup.com/socialevents/"
  },
  {
    "groupName": "New and Not So New In Dublin",
    "eventTime": "2024-04-14T15:00:00+01:00",
    "eventDetails": "Hi all! We will be meeting in St Patrick's Park beside St Patrick's Cathedral at 3pm. Dave has kindly agreed to do his great tour for €5 (instead of €10). After the tour we will go for drinks in Darkey Kelly's pub on Fishamble Street. Ancient Dublin Tour Dublin Rogues Tour invites you on a tour of Ancient Dublin taking in St Patrick's Cathedral, St Patrick's Park, the Liberties, the Iveagh Trust buildings, Christchurch Cathedral, the first Viking Settlement at Wood Quay, Fishamble Street, The Dubh Linn Gardens and Dublin Castle. The tour will last about 1 hour and 30 minutes starting at St Patrick's Cathedral, note we will not be going into any of the buildings but we will discuss the history of all these great landmarks and buildings.",
    "lat": 53.343956,
    "lon": -6.269945,
    "locationInfo": "19 Fishamble Street, Christchurch Pl, Dublin 8, D",
    "eventName": "Ancient Dublin Rogues Tour / Drinks in Darkey Kelly's  after",
    "eventEndTime": "2024-04-14T17:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/3/6/9/e/600_503173982.webp?w=750",
    "eventType": "Social",
    "eventUrl": "https://www.meetup.com/dubliners/events/300013915/?recId=e05be11b-d192-43a3-9901-fd3a93f97fbb&recSource=ml-popular-events-nearby&searchId=6fb5c5dc-5784-4d1e-902e-07f41edcc4a1",
    "groupLink": "https://www.meetup.com/dubliners/"
  },
  {
    "groupName": "Dance Workshop",
    "eventTime": "2024-04-15T20:00:00+01:00",
    "eventDetails": "Join us for the grand final of Ceol na Cathrach (Music of the City) celebrating Dublin's traditional musicians. This event will bring together in one stage the talented musicians from The Annesley House performances, showcasing their passion for Irish music in both English and Irish. Don't miss The Big Gig in Dublin's heart!",
    "lat": 53.366085,
    "lon": -6.263964,
    "locationInfo": "St. Columba's Church North Strand,, Dublin",
    "eventName": "CRADICIONAL IRISh COCISIC:\nChe BIG GIG",
    "eventEndTime": "2024-04-15T22:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/9/8/0/600_520330624.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/meetup-group-cstgommv/events/300351164/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/meetup-group-cstgommv/"
  },
  {
    "groupName": "DUBLIN RUNNERS",
    "eventTime": "2024-04-15T18:30:00+01:00",
    "eventDetails": "Join us for a 9 or 10km run in the Phoenix Park. We commence running at 6:30pm SHARP. The pace will be approximately 5:20 min/km, and you will need to be able to run at this pace unless there are others clicked into the run who can run an alternative pace with you, as the park is now too dark to run alone in. Please wear hi vis and bring a head or chest light. We meet opposite the entrance to the Papal cross carpark, on the small side road. If you have any questions, please let me know, preferably in the comments section as sometimes I don’t see the messages in the group message section. Thanks Dayle",
    "lat": 53.356953,
    "lon": -6.324432,
    "locationInfo": "Acres Road, Dublin, D",
    "eventName": "Phoenix Park Evening Run",
    "eventEndTime": "2024-04-15T19:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/d/7/2/600_511672594.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/dublinrunners/events/299706831/?recId=1532e723-22ec-4235-b77d-52e20d389aa4&recSource=ml-popular-events-nearby&searchId=4e4ab123-2564-4304-ba01-e06e493de336",
    "groupLink": "https://www.meetup.com/dublinrunners/"
  },
  {
    "groupName": "Mr.Child Fencing Club Kildare/Laois",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Junior fencing session suitable for age under 18. *important: please check our website www.mrchild.ie for details before RSVP * CMWS Hall, Kildare 18:00 – 20:00 Junior session (under 16's) 20:00 – 22:00 Adult session For fencers who doesn’t have their own equipment, you can rent set of gear from club (helmet, glove, jacket, sword, chest protector), so during rental period you are the owner of the gear and no one will share same equipment. Deposit: €200, yearly rental fee: €80 2. Beginner Class Beginner fencing program is 10 weeks continuous essential training. Ideally after the beginner training you are ready for fencing competitions. Fee: €100 3. Training Fee and Membership With increasing hall rental and club running cost, we have to increase our training fee and membership fee: Training Fee: €15 per visit. €200 for half year. €380 for year.",
    "lat": 53.155174,
    "lon": -6.912196,
    "locationInfo": "CMWS Hall, R51 WN51, Kildare",
    "eventName": "Junior Fencing Session",
    "eventEndTime": "2024-04-15T20:00:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/mrchild/events/300032061/?recId=1532e723-22ec-4235-b77d-52e20d389aa4&recSource=ml-popular-events-nearby&searchId=4e4ab123-2564-4304-ba01-e06e493de336",
    "groupLink": "https://www.meetup.com/mrchild/"
  },
  {
    "groupName": "GoodRec Play Football in Dublin Everyday",
    "eventTime": "2024-04-15T17:00:00+01:00",
    "eventDetails": "To play in this game you MUST sign up in the GoodRec App here: https://goodrec.onelink.me/59V5/meetup3 ⚠️If you don’t do this step you will not have a spot reserved⚠️ We organize games every day across the city! Indoor and outdoor, social and competitive. Choose any game you want from Monday - Sunday. Follow our Instagram to see game photos & videos: @goodrecsports Any questions, message us on the app or IG !",
    "lat": 53.339531,
    "lon": -6.230142,
    "locationInfo": "South Lotts Road, Dublin 4, D",
    "eventName": "6v6 Outdoor game @ SportsCo⚽Check Description ⬇️",
    "eventEndTime": "2024-04-15T18:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/a/e/5/600_519591941.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/goodrec-play-football-in-dublin/events/300311921/?recId=1532e723-22ec-4235-b77d-52e20d389aa4&recSource=ml-popular-events-nearby&searchId=4e4ab123-2564-4304-ba01-e06e493de336",
    "groupLink": "https://www.meetup.com/goodrec-play-football-in-dublin/"
  },
  {
    "groupName": "Dublin Zumba & Yoga Meetup Group",
    "eventTime": "2024-04-15T18:00:00+01:00",
    "eventDetails": "Are you looking to develop or enhance your yoga practice and improve your health and well-being? Then you are going to love our Fuego Flow Yoga classes! They are the perfect mix of balance & flexibility, strength & relaxation. Whether you are new to yoga or have been practicing for years, you will find something to suit your level and interest. Expect a dynamic yoga class, a fusion of Hatha, Vinyasa, and Power yoga, offering an energizing and mindful experience that leaves you feeling invigorated. This class focuses on building strength, increasing flexibility, fostering mind-body connection, and cultivating mindfulness while providing a satisfying challenge for your body. Suitable for all levels Theme of this class: Balance and Bone Health This session emphasizes balance poses that enhance bone health and stability. By improving balance, you reduce the risk of falls and fractures. Additionally, these poses engage weight-bearing bones, which can help prevent conditions like osteoporosis. Join us every Tuesday at 7pm at The Carmelite Community Centre, 56 Aungier St, Dublin 2, D02 T258 Yoga instructor for this session: Hanna Book your class directly on our website fuegoflow.ie We offer a variety of pricing options. You can get a single class, a pack of 5/10 or one of the unlimited plans. We are also currently offering all you can eat Zumba & Yoga taster month for 50% off for €74.5. You can select the \"Unlimited 1 month Zumba and Yoga pass\" HERE. Use the code TASTER-MONTH during checkout to apply the discount. Please BYOM (Bring Your Own Mat) and be sure to arrive 10 min before the class so you have time to get set up. 🧘We can’t wait to see you on the mat 🧘",
    "lat": 53.34013,
    "lon": -6.266017,
    "locationInfo": "56 Aungier Street, Dublin 2, D",
    "eventName": "Yoga Class with Fuego Flow (theme: Balance and Bone Health)",
    "eventEndTime": "2024-04-15T19:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/2/8/7/600_516593895.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/fuego-flow/events/300032368/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/fuego-flow/"
  },
  {
    "groupName": "Stefano Argentine Tango, Dublin Tango School",
    "eventTime": "2024-04-15T18:30:00+01:00",
    "eventDetails": "Hi Everyone! Hola! Ciao! Every Monday 18.30 class for absolute beginner, 19.30 for advanced and 20.30 for intermediate dancer 21.30 onwards we have social dance / practice. For Beginner or absolute beginner: no partner and no experience needed. Don't be nervous! 🙂 ... Our classes are fun and exciting - and we're very warm and welcoming 😉 • Experienced teachers. • Attentive, personal tuition. IMPORTANT:- TRAINERS and RUBBER SOLES are NOT suitable for Tango CLASS PRICES with online booking at dublintangoschoo.com https://www.dublintangoschool.com/dublin-tango-school-event-page €13 with loyalty card (6 classes for 78euro) €15 1 classes €20 2 classes in the same day €25 3 classes in the same day PRIVATE TUITION ALSO AVAILABLE. Join our FB group Facebook:- https://www.facebook.com/mytangoforyou/ NB:- to be sure you are always notified of upcoming events, festivals or any schedule changes check out our Facebook page:- Dublin Tango School (That's where we attract most of our attendees) If you prefer to receive information by email just mail me at TangoDublinSchool@gmail.com See you Monday!! Stefano",
    "lat": 53.344807,
    "lon": -6.26579,
    "locationInfo": "Sycamore Building, Sycamore Street, Temple Bar, Dublin",
    "eventName": "Tango Lessons for Beginners - Prepare to meet new people & dance!",
    "eventEndTime": "2024-04-15T21:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/d/7/0/5/600_486175045.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/stefano-tango-dublin/events/300034014/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/stefano-tango-dublin/"
  },
  {
    "groupName": "Fáilte Swing Dance Group",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "Join us as we step back into the raucous swing dancing era of the 1930’s. SCHEDULE: 7pm - 7:50pm Intermediate Swing Dance Class. Admission €10 per person. 7:50pm - 8:40pm Beginner Solo Jazz Class. Admission €10 per person. 8:40pm - 9:30pm Beginner Swing Dance Class. Admission €10 per person. 9:30pm - 10:00pm Social Dance & Jazz Jam. Free Entry. CLASS DETAILS: FREE SOCIAL DANCE & JAZZ JAM DETAILS: WHAT OTHER EVENTS ARE COMING UP: WHAT TO BRING:",
    "lat": 53.336777,
    "lon": -6.26388,
    "locationInfo": "11 Montague Lane, Dublin, D",
    "eventName": "Monday Swing Dance Social & Jazz Jam ",
    "eventEndTime": "2024-04-15T22:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/7/4/5/600_518546437.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/failte-swing-dance-group/events/300035369/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/failte-swing-dance-group/"
  },
  {
    "groupName": "Pilates as Gaeilge",
    "eventTime": "2024-04-15T18:15:00+01:00",
    "eventDetails": "PILATES AS GAEILGE - Teagascóir / Instructor - Ally Doyle Bíonn pilates ar fheabhas do shláinte an choirp agus sláinte an intinne. Fág an strus sa bhaile agus bígí linn don seisiún seo. Mura bhfuil ach cúpla focal Ghaeilge - ná bí buartha - beidh fáilte romhat! SONRAÍ ● Cúrsa 8 sheachtain i Nás na Ríogh ● Gach Luan, 18.15 - 19.15 ● €80.00 an cúrsa ● Uasmhéid de deichniúr sa rang ● Is í Gaeilge teanga an ranga ● Fluent Irish not needed Cuir áit in áirithe | Reserve your place THE ALLYWAY FUNKTIONAL TRAINING Unit 2, Milbrook Industrial Estate, Nás na Ríogh 0857636126 theallywayft@gmail.com",
    "lat": 53.216213,
    "lon": -6.659443,
    "locationInfo": "Millbrook Industrial Estate, Naas",
    "eventName": "Pilates as Gaeilge - The Allyway Funktional Training",
    "eventEndTime": "2024-04-15T19:15:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/7/9/8/6/600_474631110.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/pilates-as-gaeilge/events/300032062/?recId=1532e723-22ec-4235-b77d-52e20d389aa4&recSource=ml-popular-events-nearby&searchId=4e4ab123-2564-4304-ba01-e06e493de336",
    "groupLink": "https://www.meetup.com/pilates-as-gaeilge/"
  },
  {
    "groupName": "6/7 AstroTurf Football game - Dublin City",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "Friendly mixed game of 7 a side football. Please respect others and if you can't make it, please unRSVP to allow others to play. 6 euro to play. Rules: No sliding tackles No studded or bladed footwear Change goalkeeper every few minutes New Whatsapp group- https://chat.whatsapp.com/EtQsKYRNPE3Fv9fjomT5h8 RSVP opens 8pm on the Monday evening after the game. Please pay 6 euro ahead of the game via Revolut @revolut.me/karann03 (0833741784). https://www.paypal.me/karanbhatia03 AIB - IE45AIBK93015642136002",
    "lat": 53.350346,
    "lon": -6.242501,
    "locationInfo": "Spencer Dock, Dublin, D",
    "eventName": "6/7 a side Monday football game",
    "eventEndTime": "2024-04-15T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/a/b/f/600_483850943.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/6-aside-football-game-saturday-mornings/events/300033796/?recId=1532e723-22ec-4235-b77d-52e20d389aa4&recSource=ml-popular-events-nearby&searchId=4e4ab123-2564-4304-ba01-e06e493de336",
    "groupLink": "https://www.meetup.com/6-aside-football-game-saturday-mornings/"
  },
  {
    "groupName": "Social ⚽⚽⚽⚽ & 🍺 after",
    "eventTime": "2024-04-15T18:50:00+01:00",
    "eventDetails": "Very chill social mixed football-all levels welcome. With the emphasis on fun & meeting new people, football is also a great way to get fit and stay health. You can send money on Revolut with this username:@sean7btk or https://paypal.me/hemish16?country.x=IE&locale.x=en_US Last minute cancellations removed from the meetup. Only positive encouragement allowed-no giving out / moaning. No rough tackling. No goalkeepers ''fly keeper / last person back''-change ever 5 minutes. Please ''Leave no Trace'' with plastic bottles etc.",
    "lat": 53.339184,
    "lon": -6.286385,
    "locationInfo": "Marrowbone Lane, Dublin 8, D",
    "eventName": "Social ⚽⚽⚽⚽ ",
    "eventEndTime": "2024-04-15T20:20:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/2/b/1/600_502560689.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/dublin-city-football/events/300294807/?recId=1532e723-22ec-4235-b77d-52e20d389aa4&recSource=ml-popular-events-nearby&searchId=4e4ab123-2564-4304-ba01-e06e493de336",
    "groupLink": "https://www.meetup.com/dublin-city-football/"
  },
  {
    "groupName": "Dublin Dance co-op",
    "eventTime": "2024-04-15T19:45:00+01:00",
    "eventDetails": "www.dublindancecoop.com for more info! Every Monday at 7.45 in the F2 Rialto. 12 euros. All Welcome. Freeform dancing, stretching, rolling around and playing with anything dance related. No experience necessary!",
    "lat": 53.337223,
    "lon": -6.293315,
    "locationInfo": "3 Reuben Plaza, Dublin, D",
    "eventName": "Dublin Dance Co-op",
    "eventEndTime": "2024-04-15T21:45:00+01:00",
    "eventImage": "The img src does not exist.",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/dublin-dance-co-op/events/300035267/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/dublin-dance-co-op/"
  },
  {
    "groupName": "Emerald Everton Supporters Club ( Slatterys Capel Street)",
    "eventTime": "2024-04-15T20:00:00+01:00",
    "eventDetails": "⚽️ Chelsea V Everton #CHEEVE Live at the official home of Everton in Dublin. 📍 Slatterys Capel Street official Everton Pub. 🕐 8pm 📅 Monday 15th of April 🍳 famous Slatterys Irish Breakfast being served and food throughout the day. All Evertonians welcome,with discounts for Evertonians in the pub during the match on pints. Our own dedicated bar 1 minutes walk from temple bar, Biggest crowds of Evertonians joining us from everywhere each match day the only football supporters club based on the premises with multiple screens to cheer on the Blues .All Everton games shown upstairs at Slatterys bar 👀 #Dublin #EFC #UTFTS #Slatterys #emeraldevertonians",
    "lat": 53.348274,
    "lon": -6.268863,
    "locationInfo": "129 Capel Street, Dublin 1, D",
    "eventName": "Chelsea V Everton Slatterys Capel Street Dublin Official Everton Bar ",
    "eventEndTime": "2024-04-15T22:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/9/b/f/a/600_520299930.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/slatteyscapelstreetdublin/events/300317054/?recId=1532e723-22ec-4235-b77d-52e20d389aa4&recSource=ml-popular-events-nearby&searchId=4e4ab123-2564-4304-ba01-e06e493de336",
    "groupLink": "https://www.meetup.com/slatteyscapelstreetdublin/"
  },
  {
    "groupName": "Fitness Bootcamp Classes",
    "eventTime": "2024-04-15T19:00:00+01:00",
    "eventDetails": "Book here www.fitnessbootcamp.ie Join us for an exhilarating Outdoor Fitness Bootcamp Adventure where we will focus on fitness, wellness, and group fitness training in a fun and social setting. Our experienced instructors will guide you through a series of exercises designed to help you achieve your fitness and weight loss goals. Whether you are new in town or a fitness enthusiast, this is a great opportunity to meet new people, challenge yourself, and enjoy the outdoors while getting a great workout. Experience the perfect blend of outdoor fitness and adventure as we tackle different exercise challenges in a supportive and motivating environment. All fitness levels are welcome, so come prepared to sweat, have fun, and boost your energy levels. Don't miss out on this exciting opportunity to be a part of our Fitness Bootcamp community and kickstart your journey to a healthier lifestyle.",
    "lat": "The latitude property does not exist.",
    "lon": "The longitude property does not exist.",
    "eventName": "Outdoor Group Fitness Classes ",
    "eventEndTime": "2024-04-15T20:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/4/4/5/9/600_514637497.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/fitnessbootcamp-ie/events/300033958/?recId=1532e723-22ec-4235-b77d-52e20d389aa4&recSource=ml-popular-events-nearby&searchId=4e4ab123-2564-4304-ba01-e06e493de336",
    "groupLink": "https://www.meetup.com/fitnessbootcamp-ie/"
  },
  {
    "groupName": "Clontarf Running Group",
    "eventTime": "2024-04-15T19:30:00+01:00",
    "eventDetails": "Our weekly Monday training session :-) 5km, 7.5km or 10km",
    "lat": 53.362671,
    "lon": -6.220634,
    "locationInfo": "Clontarf Garda Station, Strandville Ave E, Dublin 3, Dublin",
    "eventName": "Clontarf Running Group - Monday run",
    "eventEndTime": "2024-04-15T21:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/c/1/7/600_515675863.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/meetup-group-xsktwudt/events/300033816/?recId=1532e723-22ec-4235-b77d-52e20d389aa4&recSource=ml-popular-events-nearby&searchId=4e4ab123-2564-4304-ba01-e06e493de336",
    "groupLink": "https://www.meetup.com/meetup-group-xsktwudt/"
  },
  {
    "groupName": "Zumba with Karla B.",
    "eventTime": "2024-04-15T18:30:00+01:00",
    "eventDetails": "Just come prepared to dance, burn some calories and have a good time! Meet new people and friends for life ♥ Wear comfortable, sweat-appropriate clothes that are easy to move in as well as supportive runners. Don't forget to bring water and a towel! Feel free to bring your bestie (s) ♥",
    "lat": 53.350407,
    "lon": -6.270815,
    "locationInfo": "1 Green Street, Dublin 7, D",
    "eventName": "ZUMBA CLASS IN DUBLIN CITY CENRE *** OFF CAPEL STREET ***",
    "eventEndTime": "2024-04-15T19:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/a/c/0/c/600_516944044.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/zumba-with-karla-b/events/300033613/?recId=1532e723-22ec-4235-b77d-52e20d389aa4&recSource=ml-popular-events-nearby&searchId=4e4ab123-2564-4304-ba01-e06e493de336",
    "groupLink": "https://www.meetup.com/zumba-with-karla-b/"
  },
  {
    "groupName": "Irish Social Dancing: Set Dancing and Sean Nós",
    "eventTime": "2024-04-15T19:15:00+01:00",
    "eventDetails": "Hello all! My name is Louise O Connor. Im a fiddle player and dancer from County Clare and I love teaching the Irish dances I grew up doing back home. You're very welcome to join us for social dancing in the Backroom of The Cobblestone starting again January 15th at 7.15pm. It is very relaxed and informal and always great fun. The dancers that have come so far have all gotten to know each other which is lovely. They have been locals as well as people coming from different countries. Booking link is here: www.louise.ie/beginners Ill be teaching set dancing which is an traditional Irish social dance. You do not need a partner to attend and all levels of dancers are welcome. We will dance a different set each night. If you are already familiar with the sets you can still enjoy dancing through the sets. We will learn the Plain, Ballyvourney Jig, Kilfenora amongst others. You can of course carry on the night in The Cobblestone Pub after where there is always brilliant live music playing. I will also be organising some live music Céilí or party events. The next one will be on January 28th in the Grand Social. All the info is here: www.louise.ie/areyadancin We'll have a live band and Irish College style dances instructed in both English and Irish",
    "lat": 53.349808,
    "lon": -6.277836,
    "locationInfo": "77 King Street North, Dublin, D",
    "eventName": "Beginners Irish Social Dancing in The Cobblestone Pub: Set Dancing ",
    "eventEndTime": "2024-04-15T20:15:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/6/6/1/a/600_506426138.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/irish-social-dancing-set-dancing/events/299894526/?recId=ee703a5c-5fcc-4866-8ff1-60dfac6ff4e8&recSource=ml-popular-events-nearby&searchId=181fbc01-4ff0-43da-938b-67ac5e44e769",
    "groupLink": "https://www.meetup.com/irish-social-dancing-set-dancing/"
  },
  {
    "groupName": "Explore the cities of UK and Ireland playing and learning",
    "eventTime": "2024-04-15T10:00:00+01:00",
    "eventDetails": "Have fun alone or make your team and start walking through Dublin's best attractions solving riddles! Learn interesting things about the city and the attractions! Play an app led city game ! Take your companion or meet new teammates and test your co operation skills! Book your game on https://worldcitytrail.com/product/dublin-scavenger-hunt ! Cost: 10 EUR (50%) off, only for this group's members, apply coupon: MTP50 in your cart page! Have fun !",
    "lat": 53.352562,
    "lon": -6.261485,
    "locationInfo": "Parnell Street, Dublin, D",
    "eventName": "Dublin scavenger hunt - Explore the city playing and learning!",
    "eventEndTime": "2024-04-15T12:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/e/a/f/600_496356527.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/explore-the-cities-of-u-k-playing-and-learning/events/300305737/?recId=bc4b4d0a-bbb6-4200-b6a4-976670eb5f4a&recSource=ml-popular-events-nearby&searchId=4b19ee29-23ec-4f8b-bea0-2ac3fb6520ea",
    "groupLink": "https://www.meetup.com/explore-the-cities-of-u-k-playing-and-learning/"
  },
  {
    "groupName": "Dublin Free Tours",
    "eventTime": "2024-04-15T11:00:00+01:00",
    "eventDetails": "You'll meet your local guide at the meeting point a little before 11AM and show your booking. Then we'll commence a fascinating walking tour through the streets, sights, and sounds of Dublin old and new. You'll get an unrivalled insight to the history and culture that has shaped the capital you see today - warts and all, discover the lesser-known, intriguing oddities of our city, and get unique insider tips for the rest of your stay. Sites and topics covered include: Dublin Castle, Christchurch, Viking & Medieval Dublin, Temple Bar, fables, folklore and mythology, Trinity College, Stephen's Green, risings and rebellions, writers & rogues and so, so much more... please remember, places are limited and you must book your spot via: https://www.generationtours.com/dublin See you soon!",
    "lat": 53.345177,
    "lon": -6.262646,
    "locationInfo": "3 Crown Alley, Dublin, D",
    "eventName": "Dublin Free Tour - essentials & oddities",
    "eventEndTime": "2024-04-15T14:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/8/a/c/7/600_500855527.webp?w=750",
    "eventType": "Sports",
    "eventUrl": "https://www.meetup.com/dublin-free-tours/events/300306228/?recId=bc4b4d0a-bbb6-4200-b6a4-976670eb5f4a&recSource=ml-popular-events-nearby&searchId=4b19ee29-23ec-4f8b-bea0-2ac3fb6520ea",
    "groupLink": "https://www.meetup.com/dublin-free-tours/"
  }
]