[
  {
    "groupName": "Dublin Health and Wealth Meetup Group",
    "eventTime": "2024-04-13T10:30:00+01:00",
    "eventDetails": "Zinzino Health and Wellness Overview and Partner Training - Dublin\nZinzino Health and Wellness Overview followed by Partner Training\nCome and learn about the products that are leading the way in Preventative Personalised Test validated Nutrition.\nVENUE: Radisson Blu Dublin Airport, Corballis, Dublin\nDATE: Saturday 13th April 2024\nTIME: 11.00am - 12.00 for Business Overview\nGuests: FREE of Charge\nPartners: €25 (includes Partner Training)\nThere will be a break before the Partner Training\n13.00pm until 17.00pm\nZinzino Chief Product Officer Dr. Colin Robertson will be covering about why Zinzino products are the preferred choice for many fitness professionals and Elite Athletes around the world due to their efficacy and test validation.\nTraining on how you can build a solid business alongside these unique products from Ambassador Dave Ives from the UK, Black Crown Kirsten Pearse from Netherlands and Director Sue Booth from the UK.\nBook your Partner tickets and Guest tickets at https://shorturl.at/nzBR3",
    "lat": 53.42632,
    "lon": -6.232335,
    "locationInfo": ", Dublin",
    "eventName": "Zinzino Health and Wellness Overview and Partner Training - Dublin",
    "eventEndTime": "2024-04-13T17:00:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/1/8/1/7/600_520206167.webp?w=750"
  },
  {
    "groupName": "The Art Of Ballet Group",
    "eventTime": "2024-04-13T10:30:00+01:00",
    "eventDetails": "Beginners ballet class suitable for absolute beginners or those with little ballet experience",
    "lat": 53.344948,
    "lon": -6.264755,
    "locationInfo": "Curved Street, Temple Bar, Dublin 2",
    "eventName": "Beginners ballet class",
    "eventEndTime": "2024-04-13T11:45:00+01:00",
    "eventImage": "The img src does not exist."
  },
  {
    "groupName": "Clontarf Running Group",
    "eventTime": "2024-04-13T10:30:00+01:00",
    "eventDetails": "The event details do not exist.",
    "lat": 53.386349,
    "lon": -6.17466,
    "locationInfo": "Raheny, Dublin",
    "eventName": "Clontarf Running Group - let’s get back in training together",
    "eventEndTime": "2024-04-13T12:30:00+01:00",
    "eventImage": "The img src does not exist."
  },
  {
    "groupName": "Wicklow Nordic Walking",
    "eventTime": "2024-04-13T10:30:00+01:00",
    "eventDetails": "Join us for a pleasant excursion on the east side! We will walk under the N11 and take the trails and paths through this old forest. Our goal is the newly refurbished Octagon - last seen behind fencing. We should be able to admire the flooring and form an opinion, now that works are complete.\nExpect some slope, some slop, and plenty of great views. A post hike lunch in the lovely Grove Bar might be on the cards too....! Please note - there is a charge of €10 per hike and I can supply poles to anyone who would like to borrow them.",
    "lat": 53.122166,
    "lon": -6.110001,
    "locationInfo": ", Willow Grove, Co",
    "eventName": "A Saturday morning visit to the Octagon! The east side of Glen of the Downs!",
    "eventEndTime": "2024-04-13T12:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/c/8/1/b/600_517311227.webp?w=750"
  },
  {
    "groupName": "Handstands+Coffee @ The Movement Studio-BOOK VIA OUR LINK!!",
    "eventTime": "2024-04-13T10:30:00+01:00",
    "eventDetails": "Registration/booking on our system at least 24 hours before class is necessary. We do not take walk ins/your rsvp on meetup is not a booking. BOOK HERE From beginner to winner! We have a special weekly 2 hour class that is more like a weekly workshop. It's a very social class, with amazing coffee, great coaching, and smiles and good work being done. Fancy trying something new? Spending time safely outside your comfort zone? Please visit themovementstudio.ie/handstandsandcoffee to book your spot Registration/booking is necessary. We do not take walk ins.",
    "lat": 53.310116,
    "lon": -6.284555,
    "locationInfo": "3 Terenure Place, Terenure, Dublin",
    "eventName": "Handstands+Coffee-BOOK VIA OUR LINK IN DESCRIPTION ONLY",
    "eventEndTime": "2024-04-13T12:30:00+01:00",
    "eventImage": "https://secure.meetupstatic.com/photos/event/5/3/b/c/600_469821436.webp?w=750"
  }
]